
export enum TimeFrame {
  /**
   * S1(1S) - 1 segundo
   *
   */
  S1 = 0.01,
  /**
   * М1(1М) - 1 minuto
   *
   */
  М1 = 1,
  /**
   * М5(5М) - 5 minutos
   *
   */
  М5 = 5,
  /**
   * М15(15М) - 15 minutos
   *
   */
  М15 = 15,
  /**
   * М30(30М) - 30 minutos
   *
   */
  М30 = 30,
  /**
   * Н1(1Н) - 1 hora
   *
   */
  Н1 = 1,
  /**
   * Н4(4Н) - 4 horas
   *
   */
  Н4 = 4,
  /**
   * D1(1D) - 1 dia
   *
   */
  D1 = 1,
  /**
   * W1(1W) - 1 semana
   *
   */
  W1 = 1,
  /**
   * MN1(1M) - 1 mês
   *
   */
  MN = 1,
}
  